//#include <stdio.h>
//
////int main()
////{
////	//1.这里的p就是一个野指针
////	//int* p;	//p是一个局部的指针变量，局部变量不初始化的话，默认是随机值
////	//*p = 20;	//非法访问内存了
////
////	//2.越界访问
////	int arr[10] = { 0 };	//超出了这个范围
////	int* p = arr;
////	int i = 0;
////	for (i = 0; i <= 10; i++)	//11个数据
////	{
////		*p = i;
////		p++;
////	}
////
////	return 0;
////}
//
////int* test()
////{
////	int a = 10;
////	return &a;
////}
////
////int main()
////{
////	//野指针
////	int* p = test();	//指向的空间被释放 //局部变量被销毁
////	*p = 20; 
////
////	return 0;
////}
//
////int main()
////{
////	int a = 0;	//初始化
////	printf("a = %d\n", a);
////
////	return 0;
////}
//
//int main()
//{
//	//指针初始化
//	//当不知道p指针变量应该初始化为什么地址的时候，直接初始化为NULL
//	//int* p = NULL;
//	////明确知道初始化的值
//	//int a = 10;
//	//int* ptr = &a;
//
//	//c语言本身是 不会检测数组的越界行为的
//	
//	int* p = NULL;
//
//	if (p != NULL)	//不为空指针再去使用
//		*p = 10;
//
//	return 0;
//}